# Script to make some example data that has a few missing values that need to be imputed in some non standard way

### Import libraries

In [1]:
import pandas as pd
import numpy as np

### Constants

In [73]:
N = 1000  # Total number of datapoints
MAX_ENGINES = 5  # Boats have engines. Longer boats have more engines. More boats = more engines
MIN_ENGINES = 0
MAX_LENGTH = 60  # Length of a boat
MIN_LENGTH = 0
CLASS_RANGE = 5  # Number of distinct boat classes (e.g. fishing, personal water craft, pontoon etc. Use letters as proxy)
BOAT_CLASSES = list(map(chr, np.arange(65, 65+CLASS_RANGE)))

### DataFrame

In [74]:
df = pd.DataFrame({'boatClass': np.random.choice(BOAT_CLASSES, N)
                 , 'boatLength': np.random.randint(MIN_LENGTH, MAX_LENGTH, N)
                 , 'boatEngines': np.random.randint(MIN_ENGINES, MAX_ENGINES, N)})
df

    boatClass  boatLength  boatEngines
0           C          10            1
1           D          45            4
2           D          23            3
3           A           0            4
4           D           7            1
..        ...         ...          ...
995         C          57            3
996         B          50            0
997         D          50            3
998         E          24            0
999         C           1            0

[1000 rows x 3 columns]

### Missing values

In [75]:
na_frac = 0.2  # Fraction of missing values
idx = df.index.to_list()
np.random.shuffle(idx)


df.iloc[idx[:int(N*na_frac)], 2] = np.nan
df

    boatClass  boatLength  boatEngines
0           C          10          1.0
1           D          45          4.0
2           D          23          3.0
3           A           0          4.0
4           D           7          1.0
..        ...         ...          ...
995         C          57          3.0
996         B          50          0.0
997         D          50          3.0
998         E          24          0.0
999         C           1          0.0

[1000 rows x 3 columns]

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   boatClass    1000 non-null   object
 1   boatLength   1000 non-null   int32
 2   boatEngines  800 non-null    float64
dtypes: float64(1), int32(1), object(1)
memory usage: 19.7+ KB

In [77]:
df.to_csv('data.csv')